// MITRE Tactic: Persistence
// Author: David McWee
// Description: Capture Create User Events and Extend the Local Group Device Event to show what group was impacted.
//              The goal is to merge these so an admin can identify when an account was created and how quickly it was added
//              to a sensitive group.
let createdUserEvents = DeviceEvents
| where ActionType contains "AccountCreated"
| project Created=TimeGenerated, CreationTimeStamp=Timestamp, DeviceId, DeviceName, AccountCreatedDomain=AccountDomain, AccountCreatedName=AccountName, CreatedBy=InitiatingProcessAccountName, AccountSid;
DeviceEvents
| where ActionType contains "AccountAddedToLocalGroup"
| extend localGroup=(parse_json(AdditionalFields).GroupName)
